jonttu0/ExpressLRS/src/src/esp32/wifi_logger.cpp
#if WIFI_LOGGER || WIFI_UPDATER || ESP_NOW

#include "wifi_logger.h"

#include <Arduino.h>
#include <freertos/ringbuf.h>
#include <ESPmDNS.h>
#if WIFI_MANAGER
#include <WiFiManager.h>
#endif
#include <WebSocketsServer.h>
#include <WebServer.h>
#include <HTTPUpdate.h>
#include <esp_wifi.h>

#include "msp.h"
#include "platform.h"
#include "targets.h"
#include "debug_elrs.h"

#define QUEUE_SIZE 256

#ifndef WIFI_AP_SSID
#define WIFI_AP_SSID "ExpressLRS AP"
#endif
#ifndef WIFI_AP_PSK
#define WIFI_AP_PSK "expresslrs"
#endif

#ifndef WIFI_TIMEOUT
#define WIFI_TIMEOUT 60 // default to 1min
#endif

#define SERVER_PORT    80
#define SERVER_WS_PORT 81


WebServer server(SERVER_PORT);
#if WIFI_LOGGER && !WIFI_UPDATER
WebSocketsServer webSocket = WebSocketsServer(SERVER_WS_PORT);
#define WEBSOCKET_BROADCASET(text) webSocket.broadcastTXT(text)
#define WEBSOCKET_SEND(sock, text) webSocket.sendTXT(sock, text)
#else
#define WEBSOCKET_BROADCASET(text) Serial.println(text)
#define WEBSOCKET_SEND(sock, text) Serial.println(text)
#endif

static const char *host = "elrs_tx";

/*************************************************************************/

static uint8_t DRAM_ATTR settings_rate = 1;
static uint8_t DRAM_ATTR settings_power = 4;
static uint8_t DRAM_ATTR settings_power_max = 8;
static uint8_t DRAM_ATTR settings_tlm = 7;
static uint8_t DRAM_ATTR settings_region = 0;

MSP DRAM_ATTR msp_handler;
mspPacket_t DRAM_ATTR msp_out;

/*************************************************************************/

static QueueHandle_t DRAM_ATTR receive_queue = NULL;
static QueueHandle_t DRAM_ATTR send_queue = NULL;

class CtrlSerialPrivate: public CtrlSerial
{
public:
  void set_queue_rx(QueueHandle_t q) {
    p_queue_rx = q;
  }
  void set_queue_tx(QueueHandle_t q) {
    p_queue_tx = q;
  }

  size_t available(void) {
    if (p_queue_rx == NULL)
      return 0;
    return uxQueueMessagesWaiting(p_queue_rx);
  }
  uint8_t read(void) {
    uint8_t out;
    if (p_queue_rx && xQueueReceive(p_queue_rx, &out, (TickType_t)1)) {
      return out;
    }
    return 0;
  }

  void write(uint8_t * buffer, size_t size) {
    if (p_queue_tx == NULL)
      return;
    while (size--)
      xQueueSend(p_queue_tx, (void *)buffer++, (TickType_t)0);
  }

private:
  QueueHandle_t p_queue_rx = NULL;
  QueueHandle_t p_queue_tx = NULL;
};

CtrlSerialPrivate DRAM_ATTR ctrl_msp_send;
CtrlSerialPrivate DRAM_ATTR ctrl_msp_receive;
CtrlSerial& ctrl_serial = ctrl_msp_send;

/******************* ESP-NOW *********************/
uint8_t wifi_ap_channel_get(void)
{
  // Calculate WiFi channel (1...12) according to UID
  uint8_t const my_uid[] = {MY_UID};
  return ((my_uid[3] + my_uid[4] + my_uid[5]) % 12) + 1;
}

#if ESP_NOW
#include <esp_now.h>

void IRAM_ATTR esp_now_recv_cb(const uint8_t *mac_addr, const uint8_t *data, int data_len)
{
  /* No data or peer is unknown => ignore */
  if (!data_len || !esp_now_is_peer_exist(mac_addr))
    return;

  //Serial.println("ESP NOW CB called!");

  // Push data into ctrl queue, ERLS task will process it
  // Note: accept only correctly formatted MSP packets
  ctrl_msp_receive.write((uint8_t*)data, data_len);
}

void init_esp_now(void)
{
  Serial.print("Initialize ESP-NOW... ");

  uint8_t channel = 0;
  wifi_second_chan_t secondChan;
  esp_wifi_get_channel(&channel, &secondChan);
  (void)secondChan;

  wifi_mode_t mode = WiFi.getMode();
  if (mode == WIFI_MODE_NULL) {
    Serial.println("(WiFi not enabled, set APSTA mode) ");
    WiFi.mode(WIFI_AP); // Start wifi
    mode = WIFI_AP;
  }

  esp_now_init();
  esp_now_register_recv_cb(esp_now_recv_cb);

  esp_now_peer_info_t peer_info = {
    .peer_addr = {0},
    .lmk = {0},
    .channel = (uint8_t)((mode == WIFI_AP) ? wifi_ap_channel_get() : channel),
    .ifidx = ESP_IF_WIFI_AP, //ESP_IF_WIFI_STA,
    .encrypt = false,
    .priv = NULL
  };
  WiFi.softAPmacAddress(peer_info.peer_addr);
  esp_now_del_peer(peer_info.peer_addr);
  esp_now_add_peer(&peer_info);

  Serial.println("DONE");
}

void deinit_esp_now(void)
{
  uint8_t mac_addr[6];
  Serial.print("Stop ESP-NOW... ");

  WiFi.softAPmacAddress(mac_addr);
  esp_now_del_peer(mac_addr);
  esp_now_deinit();
  Serial.println("DONE");
}
#endif // ESP_NOW

/*************************************************************************/

String DRAM_ATTR inputString = "";
//String my_ipaddress_info_str = "NA";

static const char PROGMEM GO_BACK[] = R"rawliteral(
<!DOCTYPE html>
<html>
    <head>
    </head>
    <body>
        <script>
            javascript:history.back();
        </script>
    </body>
</html>
)rawliteral";

#if WIFI_UPDATER

static const char PROGMEM INDEX_HTML[] = R"rawliteral(
<!DOCTYPE html>
<html>
<head>
    <meta name="viewport" content="width = device-width, initial-scale = 1.0, maximum-scale = 1.0, user-scalable=0">
    <title>ESP update</title>
    <style>
        body {
            background-color: #1E1E1E;
            font-family: Arial, Helvetica, Sans-Serif;
            Color: #69cbf7;
        }

        textarea {
            background-color: #252525;
            Color: #C5C5C5;
            border-radius: 5px;
            border: none;
        }
        #validationMessage {color: red;}
        .hide {display: none;}
    </style>
</head>
<body>
  <center>
    <p>
    ExpressLRS ESP32 TX module
    </p>
    <p>
    <div>
      <form method='POST' action='/update' enctype='multipart/form-data'>
          Update Firmware:
          <input type='file' accept='.bin' name='firmware' id='esp_fw'>
          <input type='submit' value='Flash' id='esp_submit' disabled='disabled'>
      </form>
    </div>
    </p>
    <p><span id="validationMessage" class="hide">
      Please check firmware file is correct!
    </span></p>

<script type="text/javascript">
  const message = document.getElementById('validationMessage');
  document.getElementById('esp_fw').onchange = function (ev) {
    const FIRMWARE_PATTERN = /firmware\.bin$/g;
    const uploadButton = document.getElementById('esp_submit');
    const value = ev.target.value;
    if (FIRMWARE_PATTERN.test(value)) {
      uploadButton.removeAttribute('disabled');
      message.classList.add('hide');
    } else {
      uploadButton.setAttribute('disabled', 'disabled');
      message.classList.remove('hide');
    }
  };
</script>

