jonttu0/ExpressLRS/src/src/esp32/wifi_logger.cpp
void handleSettingTlm(const char * input, int num)
{
  settings_out = "[INTERNAL ERROR] something went wrong";
  if (input == NULL || *input == '?') {
    settings_out = "ELRS_setting_tlm_input=";
    settings_out += settings_tlm;
  } else if (*input == '=') {
    input++;
    settings_out = "[L] Setting telemetry: ";
    settings_out += input;
    // Write to ELRS
    char val = *input;
    uint8_t buff[] = {2, (uint8_t)(val == 'R' ? 0xff : (val - '0'))};
    SettingsWrite(buff, sizeof(buff));
  }
  if (0 <= num)
    WEBSOCKET_SEND(num, settings_out);
  else
    WEBSOCKET_BROADCASET(settings_out);
}

void handleSettingDomain(const char * input, int num)
{
  settings_out = "[ERROR] Domain set is not supported!";
  if (input == NULL || *input == '?') {
    settings_out = "ELRS_setting_region_domain=";
    settings_out += settings_region;
  }
  if (0 <= num)
    WEBSOCKET_SEND(num, settings_out);
  else
    WEBSOCKET_BROADCASET(settings_out);
}

void SettingsSendWS(int num)
{
  handleSettingDomain(NULL, num);
  handleSettingRate(NULL, num);
  handleSettingPower(NULL, num);
  handleSettingTlm(NULL, num);
}

void MspVtxWrite(void)
{
  // TODO, FIXME: VTX power & freq
  uint8_t power = 1;
  uint16_t freq = 5880; //(uint16_t)msg[0] * 8 + msg[1]; // band * 8 + channel
  uint8_t vtx_cmd[] = {
    (uint8_t)(freq >> 8), (uint8_t)freq,
    power,
    (power == 0), // pit mode
  };

  // Fill MSP packet
  msp_out.type = MSP_PACKET_V1_CMD;
  msp_out.flags = MSP_VERSION | MSP_STARTFLAG;
  msp_out.function = MSP_VTX_SET_CONFIG;
  msp_out.payloadSize = sizeof(vtx_cmd);
  memcpy((void*)msp_out.payload, vtx_cmd, sizeof(vtx_cmd));
  // Send packet
  msp_handler.sendPacket(&msp_out, &ctrl_msp_receive);
}

void webSocketEvent(uint8_t num, WStype_t type, uint8_t *payload, size_t length)
{
  char * temp;
  //Serial.printf("webSocketEvent(%d, %d, ...)\r\n", num, type);

  switch (type)
  {
  case WStype_DISCONNECTED:
    //Serial.printf("[%u] Disconnected!\r\n", num);
    break;
  case WStype_CONNECTED:
  {
    //IPAddress ip = webSocket.remoteIP(num);
    //Serial.printf("[%u] Connected from %d.%d.%d.%d url: %s\r\n", num, ip[0], ip[1], ip[2], ip[3], payload);

    //WEBSOCKET_SEND(num, my_ipaddress_info_str);
    // Send settings
    SettingsSendWS(num);
  }
  break;
  case WStype_TEXT:
    //Serial.printf("[%u] get Text: %s\r\n", num, payload);
    // send data to all connected clients
    //WEBSOCKET_BROADCASET(payload, length);

    temp = strstr((char*)payload, "S_rate");
    if (temp) {
      handleSettingRate(&temp[6], num);
      break;
    }
    temp = strstr((char*)payload, "S_power");
    if (temp) {
      handleSettingPower(&temp[7], num);
      break;
    }
    temp = strstr((char*)payload, "S_telemetry");
    if (temp) {
      handleSettingTlm(&temp[11], num);
    }

    break;
  case WStype_BIN:
    //Serial.printf("[%u] get binary length: %u\r\n", num, length);
    //hexdump(payload, length);

    // echo data back to browser
    webSocket.sendBIN(num, payload, length);
    break;
  default:
    //Serial.printf("Invalid WStype [%d]\r\n", type);
    //WEBSOCKET_BROADCASET("Invalid WStype: " + type);
    break;
  }
}

#endif // WIFI_LOGGER

void sendReturn()
{
  server.send_P(200, "text/html", GO_BACK);
}

void handleRoot()
{
#if WIFI_LOGGER || WIFI_UPDATER
  server.send_P(200, "text/html", INDEX_HTML);
#else
  server.send_P(200, "text/html", "...Internal ERROR!!");
#endif
}

void handleMacAddress()
{
  uint8_t primaryChan;
  wifi_second_chan_t secondChan;
  esp_wifi_get_channel(&primaryChan, &secondChan);
  (void)secondChan;

  String message = "WiFi STA MAC: ";
  message += WiFi.macAddress();
  message += "\n  - channel in use: ";
  message += primaryChan;
  message += "\n  - mode: ";
  message += (uint8_t)WiFi.getMode();
  message += "\n\nWiFi SoftAP MAC: ";
  message += WiFi.softAPmacAddress();
  message += "\n  - IP: ";
  message += WiFi.softAPIP().toString();
  message += "\n";
  server.send(200, "text/plain", message);
}

void handleNotFound()
{
  String message = "File Not Found\n\n";
  message += "URI: ";
  message += server.uri();
  message += "\nMethod: ";
  message += (server.method() == HTTP_GET) ? "GET" : "POST";
  message += "\nArguments: ";
  message += server.args();
  message += "\n";
  for (uint8_t i = 0; i < server.args(); i++)
  {
    message += " " + server.argName(i) + ": " + server.arg(i) + "\n";
  }
  server.send(404, "text/plain", message);
}

uint32_t DRAM_ATTR wifi_setup_ok = false;
uint32_t DRAM_ATTR servers_started = false;

void web_services_start(void)
{
  /* Check if WiFi is set up and server are not started */
  if (servers_started || !wifi_setup_ok)
    return;

  servers_started = true;

  String instance = String(host) + "_" + WiFi.macAddress();
  instance.replace(":", "");
  MDNS.end();
  if (MDNS.begin(host)) {
    MDNS.setInstanceName(instance);
    MDNS.addService("http", "tcp", SERVER_PORT);
    MDNS.addServiceTxt("http", "tcp", "vendor", "elrs");
    MDNS.addServiceTxt("http", "tcp", "target", target_name);
    MDNS.addServiceTxt("http", "tcp", "version", LATEST_COMMIT_STR);
    MDNS.addServiceTxt("http", "tcp", "type", "tx");

    MDNS.addService("ws", "tcp", SERVER_WS_PORT);
  }

  server.on("/", handleRoot);
  server.on("/return", sendReturn);
  server.on("/mac", handleMacAddress);

  /* handling uploading firmware file (OTA update) */
  server.on("/doUpdate", HTTP_POST, []() {
    server.sendHeader("Connection", "close");
    //server.send(200, "text/plain", (Update.hasError()) ? "FAIL" : "OK");
    if (Update.hasError()) {
      //server.sendHeader("Connection", "close");
      server.send(200, "text/plain", "OTA flash failed!");
    } else {
      server.send(200, "text/html", "<HEAD><meta http-equiv=\"refresh\" content=\"0;url=/\"></HEAD>");
    }
    ESP.restart();
  }, []() {
    HTTPUpload& upload = server.upload();
    if (upload.status == UPLOAD_FILE_START) {
      platform_radio_force_stop();
      Serial.printf("Update: %s\n", upload.filename.c_str());
      if (!Update.begin(UPDATE_SIZE_UNKNOWN)) { //start with max available size
        Update.printError(Serial);
      }
    } else if (upload.status == UPLOAD_FILE_WRITE) {
      /* flashing firmware to ESP*/
      if (Update.write(upload.buf, upload.currentSize) != upload.currentSize) {
        Update.printError(Serial);
      }
    } else if (upload.status == UPLOAD_FILE_END) {
      if (Update.end(true)) { //true to set the size to the current progress
        Serial.printf("Update Success: %u\nRebooting...\n", upload.totalSize);
      } else {
        Update.printError(Serial);
      }
    }
  });

