jonttu0/ExpressLRS/src/src/esp32/wifi_logger.cpp
  server.onNotFound(handleRoot);
  server.begin();

#if WIFI_LOGGER && !WIFI_UPDATER
  webSocket.begin();
  webSocket.onEvent(webSocketEvent);
#endif // WIFI_LOGGER
}

void wifi_setup(void)
{
  IPAddress my_ip;
#if defined(WIFI_SSID) && defined(WIFI_PSK)
  uint32_t iter, jter, timeout;
#endif

  /* Check if WiFi already set up */
  if (wifi_setup_ok)
    return;

  wifi_setup_ok = true;

  uint8_t ap_mac[] = {MY_UID};
  if (ap_mac[0] & 0x1) ap_mac[0] &= ~0x1;
  esp_wifi_set_mac(WIFI_IF_AP, &ap_mac[0]);

  WiFi.setTxPower(WIFI_POWER_13dBm);
  WiFi.setHostname(host);

#if defined(WIFI_SSID) && defined(WIFI_PSK)
  Serial.print("Connecting to wifi ");

  timeout = WIFI_TIMEOUT * 2;
  timeout /= 10;

  for (iter = 0; (iter < timeout) && (WiFi.status() != WL_CONNECTED); iter++) {
    if (WiFi.status() != WL_CONNECTED) {
      WiFi.persistent(false);
      WiFi.disconnect(true);
      WiFi.mode(WIFI_OFF);
      WiFi.mode(WIFI_AP_STA);
      WiFi.begin(WIFI_SSID, WIFI_PSK);

      jter = 0;
      while (++jter <= 50) {
        vTaskDelay(100);
        if (WiFi.status() == WL_CONNECTED) {
          break;
        } else if ((jter % 10) == 0) {
          Serial.print(".");
        }
      }
    }
  }
  if (WiFi.status() == WL_CONNECTED) {
    my_ip = WiFi.localIP();
    Serial.println(" CONNECTED!");
  } else
#elif WIFI_MANAGER
  WiFiManager wifiManager;
  wifiManager.setConfigPortalTimeout(WIFI_TIMEOUT);
  if (wifiManager.autoConnect(WIFI_AP_SSID" ESP32 TX")) {
    // AP found, connected
    my_ip = WiFi.localIP();
  }
  else
#endif // WIFI_MANAGER
  {
    Serial.println(" FAILED! Starting AP...");
    // No WiFi found, start access point
    WiFi.mode(WIFI_AP);
    WiFi.softAP(WIFI_AP_SSID" ESP32 TX", WIFI_AP_PSK, wifi_ap_channel_get());
    my_ip = WiFi.softAPIP();
  }

  //my_ipaddress_info_str = "[L] My IP address = ";
  //my_ipaddress_info_str += my_ip.toString();

  Serial.print("Connect to http://elrs_tx.local or http://");
  Serial.println(my_ip);
}

int serialEvent(QueueHandle_t queue)
{
  char inChar;
  // process inputs
  uint32_t numBytes = uxQueueMessagesWaiting(queue);
  while (numBytes--)
  {
    if (xQueueReceive(queue, &inChar, (TickType_t)1)) {
      if (msp_handler.processReceivedByte(inChar)) {
        WEBSOCKET_BROADCASET("[L] MSP received");
        // msp fully received
        mspPacket_t &msp_in = msp_handler.getPacket();
        if (msp_in.type == MSP_PACKET_V1_ELRS) {
          switch (msp_in.function) {
            case ELRS_INT_MSP_PARAMS: {
              WEBSOCKET_BROADCASET("[L] ELRS params resp");
              uint8_t * payload = (uint8_t*)msp_in.payload;
              settings_rate = payload[0];
              settings_tlm = payload[1];
              settings_power = payload[2];
              settings_power_max = payload[3];
              settings_region = payload[4];
#if WIFI_LOGGER && !WIFI_UPDATER
              SettingsSendWS(-1); // send to all clients
#endif // WIFI_LOGGER && !WIFI_UPDATER
#if ESP_NOW
              esp_now_send(NULL, (uint8_t*)msp_in.payload, msp_in.payloadSize);
#endif
              break;
            }
          };
        }
        msp_handler.markPacketFree();

      } else if (!msp_handler.mspOngoing()) {
        if (inChar == '\r') {
          continue;
        } else if (inChar == '\n') {
          return 0;
        }
        inputString += inChar;
      }
    } else {
      break; // no more input data
    }
  }
  return -1;
}

void wifi_loop(QueueHandle_t queue)
{
  if (0 <= serialEvent(queue)) {
    WEBSOCKET_BROADCASET(inputString);
    inputString = "";
  }

  server.handleClient();
#if WIFI_LOGGER && !WIFI_UPDATER
  webSocket.loop();
#endif // WIFI_LOGGER
}

TaskHandle_t wifiTask = NULL;

void httpsTask(void *pvParameters)
{
  QueueHandle_t queue = (QueueHandle_t)pvParameters;
  TickType_t xLastWakeTime;
  const TickType_t xFrequency = (20 / portTICK_RATE_MS);

  Serial.println("HTTP task started...");

  xLastWakeTime = xTaskGetTickCount();
  for(;;) {
    wifi_loop(queue);
    // wait for next cycle
    vTaskDelayUntil(&xLastWakeTime, xFrequency);
  }

  /* delete the input queue */
  receive_queue = NULL;
  vQueueDelete(queue);

  /* and output queue */
  queue = send_queue;
  send_queue = NULL;
  vQueueDelete(queue);

  /* remove task */
  vTaskDelete( NULL );
  wifiTask = NULL;
  Serial.println("HTTP task exit");
}

void wifi_init(void)
{
  if (wifiTask != NULL) {
    Serial.println("HTTP task already started");
    return;
  }

  if (receive_queue == NULL)
    receive_queue = xQueueCreate(QUEUE_SIZE, sizeof(uint8_t));
  if (send_queue == NULL)
    send_queue = xQueueCreate(QUEUE_SIZE, sizeof(uint8_t));

  ctrl_msp_send.set_queue_rx(send_queue);
  ctrl_msp_send.set_queue_tx(receive_queue);

  ctrl_msp_receive.set_queue_rx(receive_queue);
  ctrl_msp_receive.set_queue_tx(send_queue);

#if WIFI_LOGGER && WIFI_LOGGER_AUTO_START && !WIFI_UPDATER
  wifi_setup();
  web_services_start();
#endif
#if ESP_NOW
  init_esp_now();
#endif

  xTaskCreatePinnedToCore(
    httpsTask,              // Function to implement the task
    "wifiTask",             // Name of the task
    4096,                   // Stack size in bytes
    receive_queue,          // Task input parameter
    (tskIDLE_PRIORITY + 1), // Priority of the task
    &wifiTask, 0);
  Serial.println("HTTP task started");
}

void wifi_start(void)
{
  Serial.println("== Starting WiFi services ==");
#if ESP_NOW
  deinit_esp_now();
#endif
  wifi_init();
  wifi_setup();
  web_services_start();
#if ESP_NOW
  init_esp_now();
#endif
  Serial.println("WiFi services started!");
}

void wifi_stop(void)
{
}

/*************************************************************************/

#if WIFI_LOGGER && !WIFI_UPDATER
int DebugSerial::available(void)
{
  if (receive_queue == NULL)
    return 0;
  return uxQueueMessagesWaiting(receive_queue);
}

int DebugSerial::availableForWrite(void)
{
  if (receive_queue == NULL)
    return 0;
  return uxQueueSpacesAvailable(receive_queue);
}

int DebugSerial::peek(void)
{
  return 0;
}

int DebugSerial::read(void)
{
  uint8_t out;
  if (receive_queue && xQueueReceive(receive_queue, &out, (TickType_t)1)) {
    return out;
  }
  return 0;
}

void DebugSerial::flush(void)
{
  /* do nothing */
}

size_t DebugSerial::write(uint8_t data)
{
  return write(&data, 1);
}

size_t DebugSerial::write(const uint8_t *buffer, size_t size)
{
  size_t num = 0;
  if (receive_queue == NULL)
    return 0;
  while (size--) {
    xQueueSend(receive_queue, (void *)buffer++, (TickType_t)0);
    num++;
  }
  return num;
}

DebugSerial wifi_logger_serial;
#endif // WIFI_LOGGER

#endif // WIFI_LOGGER || WIFI_UPDATER
